package Array2;

import java.util.Scanner;

/* 배열 처리 : int[][] num = new int[5][5];
 * 1 	4 	9 	16	 25
 * 0 	36 	49 	64	 81
 * 0 	0  100  121  144
 * 0    0   0  169   196
 * 0    0   0   0    225
 * 
 * [0][0] = 1, [0][1] = 4, [0][2] = 9, [0][3] = 16, [0][4] = 25
 * [1][0] = 0, [1][1] = 36, [1][2] = 49, [1][3] = 64, [1][4] = 81
 * [2][0] = 0, [2][1] = 0, [2][2] = 100, [2][3] = 121, [2][4] = 144
 * [3][0] = 0, [3][1] =  0, [3][2] =  0, [3][3] = 169, [3][4] = 196
 * [4][0] = 0, [4][1] =  0, [4][2] =  0, [4][3] =  0, [4][4] =  225
 * 
 * - 특징 : 열이 행을 따라갑니다.
 * - 행 증가, 열 증가
 * - 곱셈
 */
public class ArraySample2_8 {

	public static void main(String[] args) {
		// 2차원 처리
		int[][] num = new int[5][5];//[0][0] ~ [4][4]
		int su = 0;
		
		// 데이터 입력
		for (int i = 0; i <= num.length; i++) { // row, 0<5, 1<5, 2<5, 3<5, 4<5, 5<5(false)

			for (int j = i; j < num.length; j++) { 
				// 0<5, 1<5, 2<5, 3<5, 4<5, 5<5(false)
				
						su++;						
						num[i][j] = su * su;//1, 4, 9, 16, 25, 36........225
				//num[0][0]=1, num[0][1]=4, num[0][2]=9, num[0][3]=16, num[0][5]=25
				//num[1][0]=0, num[1][1]=36, num[1][2]=49, num[1][3]=64, num[1][4]=81,
				//num[2][0]=0, num[2][1]=0, num[2][2]=100, num[2][3]=121, num[2][4]=144,
				//num[3][0]=0, num[3][1]=0, num[3][2]=0, num[3][3]=169, num[3][4]=196
				//num[4][0]=0, num[4][1]=0,	num[4][2]=0, num[4][3]=0, num[4][4]=225					
			}
		}	

		// 데이터 출력
		int i=0; 
		for (   ; i < num.length; i++) { // row, 0행, 1행...

			for (int j = 0; j < num.length; j++) { // column, 0열, 1열, 2열,....
				System.out.print(num[i][j] + "\t"); 
				}
			System.out.println();
		}
		
	}

}
