package Array2;

import java.util.Scanner;

/* 배열 처리 : int[][] num = new int[5][5];
 * 1 	0 	0 	0	0
 * 2 	3 	0 	0	0
 * 4 	5 	6   0   0
 * 7 	8   9   10  0
 * 11  12  13   14  15
 * 
 * [0][0] = 1, [0][1] = 0, [0][2] = 0, [0][3] = 0, [0][4] = 0
 * [1][0] = 2, [1][1] = 3, [1][2] = 0, [1][3] = 0, [1][4] = 0
 * [2][0] = 4, [2][1] = 5, [2][2] = 6, [2][3] = 0, [2][4] = 0
 * [3][0] = 7, [3][1] = 8, [3][2] = 9, [3][3] = 10, [3][4] = 0
 * [4][0] = 11, [4][1] = 12, [4][2] = 13, [4][3] = 14, [4][4] = 15
 * 
 * - 특징 : i와 j가 둘다 변경되면서 값이 변경되어집니다.	
 * - 행 증가, 열 증가
 */
public class ArraySample2_5 {

	public static void main(String[] args) {
		// 2차원 처리
		int[][] num = new int[5][5];//[0][0] ~ [4][4]
		int su = 0;
		
		// 데이터 입력
		for (int i = 0; i < num.length; i++) { // row, 0<5, 1<5, 2<5, 3<5, 4<5, 5<5...

			for (int j = 0; j <= i; j++) { 
				// 0<=0열, 1<=0열,
				// 0<=0, 1<=1, 2<=1 
				// 0<=2, 1<=2, 2<=2, 3<=3...
				// 0<=3, 1<=3, 2<=3, 3<=3, 4<=3
				// 0<=4, 1<=4, 2<=4, 3<=4, 4<=4 5<=4
						su++;
						num[i][j] = su;//1, 2, 3, 4, 5, 6........15
				//num[0][0]=1, 0000
				//num[1][0]=2, num[1][1]=3, 000
				//num[2][0]=4, num[2][1]=5, num[2][2]=6, 00
				//num[3][0]=7, num[3][1]=8, num[3][2]=9, num[3][3]=10, 0 
				//num[4][0]=11, num[4][1]=12, num[4][2]=13, num[4][3]=14, num[4][4]=15	
			}
		}	

		// 데이터 출력
		int i=0; 
		for (   ; i < num.length; i++) { // row, 0행, 1행...

			for (int j = 0; j < num.length; j++) { // column, 0열, 1열, 2열,....
				System.out.print(num[i][j] + "\t"); 
				}
			System.out.println();
		}
		
	}

}
