package Array2;

import java.util.Scanner;

/* 모래 시계 배열 처리 : int[][] num = new int[5][5];
 * 1 	2 	3 	4	 5
 * 0 	6 	7 	8	 0
 * 0 	0   9   0    0
 * 0   10  11  12    0
 * 13  14  15  16   17
 * 
 * [0][0] = 1, [0][1] = 2, [0][2] = 3, [0][3] = 4, [0][4] = 5
 * [1][0] = 0, [1][1] = 6, [1][2] = 7, [1][3] = 8, [1][4] = 0
 * [2][0] = 0, [2][1] = 0, [2][2] = 9, [2][3] = 0, [2][4] = 0
 * [3][0] = 0, [3][1] = 10, [3][2] = 11, [3][3] = 12, [3][4] = 0
 * [4][0] = 13, [4][1] = 14, [4][2] = 15, [4][3] = 16, [4][4] = 17
 * 
 * - 특징 : 열이 행을 따라갑니다. 열이 전체크기에서 행만큼 줄어듭니다. 
 * - 행 증가, 열 감소, 다시 열 증가
 * - +1
 */
public class ArraySample2_9 {

	public static void main(String[] args) {
		// 2차원 처리
		int[][] num = new int[5][5];// [0][0] ~ [4][4]
		int su = 0;

		// 데이터 입력 : 행 증가, 열 감소
		for (int i = 0; i < num.length - 3; i++) { // row, 0<2, 1<2, 2<2(false)

			for (int j = i; j <= 4 - i; j++) {
				// 0<=4, 1<=4, 2<=4, 3<=4, 4<=4, 5<=4(false)
				// 1<=3, 2<=3, 3<=3, 4<=3(false)
				su++;
				num[i][j] = su;// 1, 2, 3, 4, 5, 36........225
				// num[0][0]=1, num[0][1]=2, num[0][2]=3, num[0][3]=4, num[0][5]=5
				// num[1][0]=0, num[1][1]=6, num[1][2]=7, num[1][3]=8, num[1][4]=0,
			}
		}

		// 데이터 입력 : 행 증가, 열 증가
		for (int i = 2; i <= 4; i++) { // row, 2<=4, 3<=4, 4<=4, 5<=4(false)

			for (int j = 4-i; j <= i; j++) {
				// 2<=2, 3<=2(false)
				// 1<=3, 2<=3, 3<=3, 4<=3(false)
				// 0<=4, 1<=4, 2<=4, 3<=4, 4<=4, 5<=4(false)
				su++;
				num[i][j] = su;// 1, 2, 3, 4, 5, 36........225
				//num[2][0]=0, num[2][1]=0, num[2][2]=9, num[2][3]=0, num[2][4]=0,
				//num[3][0]=0, num[3][1]=10, num[3][2]=11, num[3][3]=12, num[3][4]=0
				//num[4][0]=13, num[4][1]=14,	num[4][2]=15, num[4][3]=16, num[4][4]=17	
			}
		}

		// 데이터 출력
		int i = 0;
		for (; i < num.length; i++) { // row, 0행, 1행...

			for (int j = 0; j < num.length; j++) { // column, 0열, 1열, 2열,....
				System.out.print(num[i][j] + "\t");
			}
			System.out.println();
		}

	}

}


